brew 'vim'
brew 'neovim'
brew 'tree'
brew 'tmux'
brew 'autoenv'
brew 'autojump'
brew 'zsh'
brew 'carlocab/personal/unrar'
brew 'jq'
brew 'oath-toolkit'
brew 'desk'
brew 'fzf'
brew 'bat'
brew 'tldr'
brew 'fd'
brew 'netcat'

tap 'homebrew/cask'

# productivity
cask 'alfred'
cask 'rectangle'
cask 'caffeine'
cask 'shortcat'
cask 'evernote'
# https://github.com/dustinrue/ControlPlane
cask 'controlplane'
cask 'numi'
cask 'macdown'
cask 'quitter'

# cask 'mysimbl' # for afloat

# development
cask 'sublime-text'
cask 'sourcetree'
cask 'iterm2'
cask 'paw'
cask 'github'
cask 'flycut'
cask 'gas-mask'
cask 'jd-gui'
cask 'docker'

# utilities
cask 'keka' # archiver
cask 'appcleaner'
cask 'disk-inventory-x'

# video players
cask 'iina'
cask 'qqmusic'

# writing
cask 'deckset'

# fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-fira-code'
cask 'font-noto-sans-cjk'
cask 'font-hack-nerd-font'

cask 'qlcolorcode' # Enable syntax highlighting in source files
cask 'qlstephen' # Preview plain text files without extension
cask 'qlmarkdown' # Preview Markdown files
cask 'quicklook-json' # Preview json jiles
cask 'qlprettypatch' # diff/patch files
cask 'v2rayu'
cask 'clashx'
cask 'unexpectedly' # view crash log

# log into Mac App Store up front
mas 'wechat', id: 836500024
mas 'alinof-timer', id: 512464723
mas 'be-focused-focus-timer', id: 973134470


# cask 'virtualbox'
# cask 'nvalt'
# cask 'slack'
# cask 'neteasemusic'
# mas 'kindle', id: 405399194
