brew 'vim', args: ['override-system-vi']
brew 'tree'
brew 'tmux'
brew 'autoenv'
brew 'autojump'
brew 'zsh'
brew 'unrar'
brew 'jq'
brew 'oath-toolkit'
brew 'desk'
#brew 'macvim', args: ['with-override-system-vim']

tap 'caskroom/cask'

# productivity
cask 'alfred'
cask 'spectacle'
cask 'caffeine'
cask 'nvalt'
cask 'shortcat'
cask 'evernote'
# https://github.com/dustinrue/ControlPlane
cask 'controlplane'
cask 'numi'
cask 'macdown'
cask 'quitter'

cask 'mysimbl' # for afloat

# development
cask 'vagrant'
cask 'virtualbox'
cask 'sublime-text'
cask 'sourcetree'
cask 'iterm2'
cask 'p4merge'
cask 'paw'
cask 'github-desktop'
cask 'flycut'
cask 'gas-mask'
cask 'jd-gui'
cask 'docker'

# utilities
cask 'skype'
cask 'keka' # archiver
cask 'appcleaner'
cask 'disk-inventory-x'
cask 'posterazor'
cask 'flux'

# video players
cask 'vlc'
cask 'iina'
cask 'neteasemusic'
# cask 'mpv'


# fonts
tap 'caskroom/fonts'
cask 'font-inconsolata'

cask 'qlcolorcode' # Enable syntax highlighting in source files
cask 'qlstephen' # Preview plain text files without extension
cask 'qlmarkdown' # Preview Markdown files
cask 'quicklook-json' # Preview json jiles
cask 'qlprettypatch' # diff/patch files

# Alcatraz Xcode plugin manager
# cask 'alcatraz'
mas 'wechat', id: 836500024
mas 'kindle', id: 405399194
mas 'alinof-timer', id: 512464723
